<?php

$configMainCode = <<<EOT
<?php

return [
	// Режим работы приложения
	'mode' => 'dev',

	// Роутинг по сервисам
	'router' => require_once(__DIR__ . '/routes.php'),
	// Настройки базы данных
	'db' => require_once(__DIR__ . '/db.php'),

	// Каталоги, в которых расположены пакеты
	'packagesMap' => [
		'vendor',
	],

	// Алиасы уровня приложения
	'aliases' => [
	],

	// Глобальный js-код, выполняемый до разворачивания корневого модуля
	//'jsBootstrap' => '',
	// Глобальный js-код, выполняемый после разворачивания корневого модуля
	//'jsMain' => '',
];

EOT;


$configRoutesCode = <<<EOT
<?php
/*
Настройка для инструмента, маршрутизирующего запросы
Варианты типов:
	- map (поясняющий параметр 'routes' - сама карта, либо 'path' - где лежит карта. Сама карта - массив, где ключ - URL запроса (или регулярка), значение - данные от объекте, куда перенаправляется запрос)
	- class ((поясняющий параметр 'name' - имя класса роутера. Должен реализовать метод route(), который должен возвращать данные от объекте, куда перенаправляется запрос)
*/
return [
	'type' => 'map',
	'routes' => [
		// '/' => '', //TODO - must be required
	],
];

EOT;


$configModuleCode = <<<EOT
<?php

/*
В каждом модуле может быть создан файл (config|config/main).(php|yaml|json) с индивидуальными настройками.
Если файла нет, или в нем отсутствуют какие-либо настройки, они будут браться из этого файла
*/

return [
	// Набор алиасов уровня модуля, используемый всеми модулями
	'commonAliases' => [],
	// В конкретном модуле можно установить значение false, тогда общие алиасы не будут импортироваться
	'useCommonAliases' => true,

	// Соглашения внутренней структуры модуля - не включены в алиасы, т.к. имеют особое значение для целостности модуля, ключи неизменны
	// каталог с js-кодом, основным кодом приложения, исполняемым на клиенте
	'frontend' => 'frontend',
	// js-код, выполняемый до загрузки блоков модуля
	'jsBootstrap' => '_bootstrap.js',
	// основной js-код
	'jsMain' => '_main.js',

	// пути к ответчикам (php-классам, обрабатывающим ajax-запросы). Может быть несколько (массив)
	'respondents' => 'backend',

	// каталог с блоками интерфейса
	'view' => 'view',
	// корневой блок
	'viewIndex' => '_root.php',

	// расположение ресурсов
	'images' => 'assets/images',
	'css' => 'assets/css',
];

EOT;


$configServiceCode = <<<EOT
<?php
return [
	// Каталог(и) с модулями
	'modules' => 'module',

	// Каталог(и) с моделями
	'models' => 'model',

	// Класс, управляющий сохранением/загрузкой моделей
	'modelCrudAdapter' => '\lx\DbCrudAdapter',
];

EOT;


$configDbCode = <<<EOT
<?php
return [
	'dbList' => [
		'dbKey' => [
			'hostname' => 'localhost',
			'username' => 'username',
			'password' => 'password',
			'dbName' => 'dbName'
		],
	],

	'dbMap' => [
		'__default__' => ['db' => 'dbKey'],
	],
];

EOT;
